# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps

#tap 'homebrew/dupes'

# Définir où placer les applications installées
cask_args appdir: '/Applications'

# Permettre l'installation d'applications de l'AppStore
brew 'mas'

# Réseau
brew 'curl'
brew 'dnsmasq'
brew 'openssh'
brew 'openssl'
brew 'rsync'
brew 'storm'
brew 'wget'

# Terminal
cask 'iterm2'

# Améliorations d'interface et usage
cask 'coconutbattery'
cask 'rcdefaultapp'
#mas 'BetterSnapTool', id: 417375580

# Utilitaires divers
cask 'disk-inventory-x'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
mas 'The Unarchiver', id: 425424353
mas 'Memory Clean 2', id: 1114591412

# Backup et synchro
#brew 'mackup'
#cask 'carbon-copy-cloner'
#cask 'crashplan'
#cask 'google-backup-and-sync'

# Web
cask 'firefox'
cask 'google-chrome'

# Développement
brew 'git'
brew 'node'
brew 'pkg-config'
brew 'ruby'
cask 'dbeaver-community'
cask 'docker'
cask 'github-desktop'
cask 'intellij-idea-ce'
cask 'sourcetree'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
#mas 'Xcode', id: 497799835

# Images
brew 'graphicsmagick'
brew 'gsl'
brew 'imagemagick@6'
cask 'imageoptim'

# Vidéos
brew 'ffmpeg'

# Divertissement
cask 'steam'
#cask 'minecraft'

# Communication
cask 'skype'
mas 'Twitter', id: 409789998
mas 'Rocket.Chat+' , id: 1086818840

# Bureautique
cask 'libreoffice'
cask 'macdown'
mas 'Evernote', id: 406056744
